#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # scaleway_k8s_cluster.monadial_k8s_cluster will be created
  + resource "scaleway_k8s_cluster" "monadial_k8s_cluster" {
      + apiserver_url               = (known after apply)
      + cni                         = "cilium"
      + created_at                  = (known after apply)
      + delete_additional_resources = false
      + description                 = "Monadial K8S production cluster"
      + id                          = (known after apply)
      + kubeconfig                  = (known after apply)
      + name                        = "monadial-k8s-cluster"
      + organization_id             = (known after apply)
      + project_id                  = (known after apply)
      + region                      = (known after apply)
      + status                      = (known after apply)
      + updated_at                  = (known after apply)
      + upgrade_available           = (known after apply)
      + version                     = "1.21.0"
      + wildcard_dns                = (known after apply)

      + auto_upgrade {
          + enable                        = (known after apply)
          + maintenance_window_day        = (known after apply)
          + maintenance_window_start_hour = (known after apply)
        }

      + autoscaler_config {
          + balance_similar_node_groups      = true
          + disable_scale_down               = false
          + estimator                        = "binpacking"
          + expander                         = "random"
          + expendable_pods_priority_cutoff  = -10
          + ignore_daemonsets_utilization    = true
          + max_graceful_termination_sec     = 600
          + scale_down_delay_after_add       = "5m"
          + scale_down_unneeded_time         = "10m"
          + scale_down_utilization_threshold = 0.5
        }

      + open_id_connect_config {
          + client_id       = (known after apply)
          + groups_claim    = (known after apply)
          + groups_prefix   = (known after apply)
          + issuer_url      = (known after apply)
          + required_claim  = (known after apply)
          + username_claim  = (known after apply)
          + username_prefix = (known after apply)
        }
    }

  # scaleway_k8s_pool.monadial_k8s_pool will be created
  + resource "scaleway_k8s_pool" "monadial_k8s_pool" {
      + autohealing         = true
      + autoscaling         = true
      + cluster_id          = (known after apply)
      + container_runtime   = "docker"
      + created_at          = (known after apply)
      + current_size        = (known after apply)
      + id                  = (known after apply)
      + max_size            = 6
      + min_size            = 2
      + name                = "monadial-k8s-pool"
      + node_type           = "DEV1-M"
      + nodes               = (known after apply)
      + region              = (known after apply)
      + size                = 2
      + status              = (known after apply)
      + updated_at          = (known after apply)
      + version             = (known after apply)
      + wait_for_pool_ready = false
      + zone                = (known after apply)

      + upgrade_policy {
          + max_surge       = (known after apply)
          + max_unavailable = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @tmihalicka, Action: `pull_request`, Working Directory: ``, Workflow: `Monadial Terraform IAC`*